Repository: daonb/vpms
Catalog: vpms/locale/*/LC_MESSAGES/django.po
Languages: he

source: name
he: שם

source: arrived
he: הגיע/ה

source: volunteer name
he: שם מתנדב/ת

source: searched
he: חיפשת

source: there are no results
he: אין תוצאות

source: Please correct the error below.
he: אנא תקנו את השגיאה הבאה.

source: add volunteer
he: הוספת מתנדב/ת

source: add project
he: הוספת פרויקט

source: project name
he: שם פרויקט

source: project
he: פרויקט
